/*
题目描述
任务很简单. 确定国际象棋棋盘上处于骑士攻击之下的格子个数. 棋盘上没有其它棋子. 骑士的走法: 横(纵)向走两个格, 再纵(横)向走一个格(类似于中国象棋中的马). 

输入
第一行为测试次数N, 1 ≤ N ≤ 100. 
后面N行每行包含一个坐标表示骑士的位置. 
字母表示横向位置, 数字表示纵向位置. 
输出
输出N行. 每行一个整数, 表示骑士可攻击的格子个数. 
*/

#include <stdio.h>
int main(void)
{
	int n,a,b,i,d,j,k,sum;
	char c;
	scanf("%d",&n);
	getchar();
	for(i=0;i<n;i++)
	{
		sum=0;
		scanf("%c%d",&c,&b);
		getchar();
		a=c-'a'+1;
		if((a-1>0&&a-1<9)&&(b-2>0&&b-2<9))
			sum++;
		if((a-1>0&&a-1<9)&&(b+2>0&&b+2<9))
			sum++;
		if((a+2>0&&a+2<9)&&(b+1>0&&b+1<9))
			sum++;
		if((a+1>0&&a+1<9)&&(b-2>0&&b-2<9))
			sum++;
		if((a+1>0&&a+1<9)&&(b+2>0&&b+2<9))
			sum++;
		if((a-2>0&&a-2<9)&&(b-1>0&&b-1<9))
			sum++;
		if((a-2>0&&a-2<9)&&(b+1>0&&b+1<9))
			sum++;
		if((a+2>0&&a+2<9)&&(b-1>0&&b-1<9))
			sum++;
		printf("%d\n",sum);
	}
}
